mimas9107/esp-miao/firmware/esp32_edge_impulse/main/main.cpp
/*
 * Edge Impulse Wake Word Detection with INMP441 I2S Microphone
 * 
 * Hardware: ESP32 DevKit V1 + INMP441
 * Model:    esp-miao-mfcc (MFCC-based, 3 classes: heymiaomiao / noise / unknown)
 * 
 * I2S Configuration:
 *   - Pins: BCK=32, WS=25, DIN=33 (Matching inmp441_recorder configuration)
 *   - Mode: Stereo Read + Software Left Channel Extraction
 *     (Required for ESP32 HW V1 compatibility with I2S std driver)
 *   - Clock: APLL enabled for accurate 16kHz sample rate
 * 
 * Inference:
 *   - Continuous sliding window (16000 samples, 4 slices)
 *   - Wake word: "heymiaomiao" (Threshold > 0.6)
 */

#include <stdio.h>
#include <string.h>
#include <math.h>

#include "edge-impulse-sdk/classifier/ei_run_classifier.h"

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/event_groups.h"
#include "driver/gpio.h"
#include "driver/i2s_std.h"
#include "esp_log.h"
#include "esp_err.h"
#include "esp_wifi.h"
#include "esp_event.h"
#include "nvs_flash.h"
#include "nvs.h" // For NVS functions
#include "sdkconfig.h" // For Kconfig values
#include "esp_idf_version.h"
#include "cJSON.h" // Added back
#include "mbedtls/base64.h"

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
#include "esp_websocket_client.h"
#endif

/* ---------- Configuration ---------- */

// Removed hardcoded WIFI_SSID and WIFI_PASS, now from NVS/Kconfig
#define SERVER_URL      "ws://192.168.1.103:8000/ws/esp32_01" // Still hardcoded for now, could also be NVS/Kconfig

#define LED_PIN         GPIO_NUM_2

#define I2S_BCK_GPIO    GPIO_NUM_32
#define I2S_WS_GPIO     GPIO_NUM_25
#define I2S_DIN_GPIO    GPIO_NUM_33

/* ---------- WiFi & WS Globals ---------- */

static EventGroupHandle_t wifi_event_group;
const int WIFI_CONNECTED_BIT = BIT0;
static esp_websocket_client_handle_t ws_client = NULL;
static bool ws_connected = false;

static const char *TAG = "ESP-MIAO";

// NVS handles
static nvs_handle_t nvs_wifi_handle;

// WiFi Credentials
static char s_wifi_ssid[32];
static char s_wifi_password[64];

/* ---------- NVS Helper Functions ---------- */

esp_err_t get_wifi_credentials_from_nvs(void) {
    esp_err_t err;
    size_t ssid_len = sizeof(s_wifi_ssid);
    size_t pass_len = sizeof(s_wifi_password);

    err = nvs_get_str(nvs_wifi_handle, "wifi_ssid", s_wifi_ssid, &ssid_len);
    if (err != ESP_OK && err != ESP_ERR_NVS_NOT_FOUND) {
        ESP_LOGE(TAG, "Failed to get WiFi SSID from NVS (%s)", esp_err_to_name(err));
        return err;
    }

    err = nvs_get_str(nvs_wifi_handle, "wifi_pass", s_wifi_password, &pass_len);
    if (err != ESP_OK && err != ESP_ERR_NVS_NOT_FOUND) {
        ESP_LOGE(TAG, "Failed to get WiFi Password from NVS (%s)", esp_err_to_name(err));
        return err;
    }

    if (err == ESP_ERR_NVS_NOT_FOUND) {
        ESP_LOGI(TAG, "WiFi credentials not found in NVS. Using Kconfig defaults.");
        strncpy(s_wifi_ssid, CONFIG_ESP_MIAO_WIFI_SSID, sizeof(s_wifi_ssid) - 1);
        s_wifi_ssid[sizeof(s_wifi_ssid) - 1] = '\0';
        strncpy(s_wifi_password, CONFIG_ESP_MIAO_WIFI_PASSWORD, sizeof(s_wifi_password) - 1);
        s_wifi_password[sizeof(s_wifi_password) - 1] = '\0';
        
        // Save Kconfig defaults to NVS for future use
        ESP_LOGI(TAG, "Saving Kconfig defaults to NVS.");
        nvs_set_str(nvs_wifi_handle, "wifi_ssid", s_wifi_ssid);
        nvs_set_str(nvs_wifi_handle, "wifi_pass", s_wifi_password);
        nvs_commit(nvs_wifi_handle);
    } else {
        ESP_LOGI(TAG, "WiFi credentials loaded from NVS.");
    }
    return ESP_OK;
}

esp_err_t save_wifi_credentials_to_nvs(const char *ssid, const char *password) {
    esp_err_t err;
    err = nvs_set_str(nvs_wifi_handle, "wifi_ssid", ssid);
    if (err != ESP_OK) return err;
    err = nvs_set_str(nvs_wifi_handle, "wifi_pass", password);
    if (err != ESP_OK) return err;
    err = nvs_commit(nvs_wifi_handle);
    ESP_LOGI(TAG, "WiFi credentials saved to NVS.");
    return err;
}


/* ---------- WiFi Event Handler ---------- */

static void wifi_event_handler(void* arg, esp_event_base_t event_base,
                                int32_t event_id, void* event_data)
{
    if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_START) {
        esp_wifi_connect();
    } else if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_DISCONNECTED) {
        esp_wifi_connect();
        xEventGroupClearBits(wifi_event_group, WIFI_CONNECTED_BIT);
        ESP_LOGI(TAG, "retry to connect to the AP");
    } else if (event_base == IP_EVENT && event_id == IP_EVENT_STA_GOT_IP) {
        ip_event_got_ip_t* event = (ip_event_got_ip_t*) event_data;
        ESP_LOGI(TAG, "got ip:" IPSTR, IP2STR(&event->ip_info.ip));
        xEventGroupSetBits(wifi_event_group, WIFI_CONNECTED_BIT);
    }
}

static void init_wifi(void)
{
    wifi_event_group = xEventGroupCreate();

    // Open NVS for WiFi credentials
    esp_err_t err = nvs_open("storage", NVS_READWRITE, &nvs_wifi_handle);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Error (%s) opening NVS handle!", esp_err_to_name(err));
        return;
    }

    // Get WiFi credentials from NVS or Kconfig
    ESP_ERROR_CHECK(get_wifi_credentials_from_nvs());

    ESP_ERROR_CHECK(esp_netif_init());
    ESP_ERROR_CHECK(esp_event_loop_create_default());
    esp_netif_create_default_wifi_sta();

    wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
    ESP_ERROR_CHECK(esp_wifi_init(&cfg));

    esp_event_handler_instance_t instance_any_id;
    esp_event_handler_instance_t instance_got_ip;
    ESP_ERROR_CHECK(esp_event_handler_instance_register(WIFI_EVENT,
                                                        ESP_EVENT_ANY_ID,
                                                        &wifi_event_handler,
                                                        NULL,
                                                        &instance_any_id));
    ESP_ERROR_CHECK(esp_event_handler_instance_register(IP_EVENT,
                                                        IP_EVENT_STA_GOT_IP,
                                                        &wifi_event_handler,
                                                        NULL,
                                                        &instance_got_ip));

    wifi_config_t wifi_config = {
        .sta = {
            // Use s_wifi_ssid and s_wifi_password
            .ssid = "", // Will be copied below
            .password = "", // Will be copied below
        },
    };
    strncpy((char *)wifi_config.sta.ssid, s_wifi_ssid, sizeof(wifi_config.sta.ssid) - 1);
    strncpy((char *)wifi_config.sta.password, s_wifi_password, sizeof(wifi_config.sta.password) - 1);
    
