mimas9107/esp-miao/firmware/esp32_edge_impulse/main/main.cpp
    ESP_LOGI(TAG, "Connecting to WiFi SSID: %s", (char *)wifi_config.sta.ssid);

    ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA));
    ESP_ERROR_CHECK(esp_wifi_set_config(WIFI_IF_STA, &wifi_config));
    ESP_ERROR_CHECK(esp_wifi_start());

    ESP_LOGI(TAG, "wifi_init_sta finished.");
    xEventGroupWaitBits(wifi_event_group, WIFI_CONNECTED_BIT, pdFALSE, pdFALSE, portMAX_DELAY);
    ESP_LOGI(TAG, "wifi_init_sta connected.");
}

/* ---------- Hardware Control ---------- */

static void handle_server_action(const char *json_str)
{
    cJSON *root = cJSON_Parse(json_str);
    if (!root) return;

    cJSON *type = cJSON_GetObjectItem(root, "type");
    if (type && strcmp(type->valuestring, "action") == 0) {
        cJSON *payload = cJSON_GetObjectItem(root, "payload");
        if (payload) {
            const char *action = cJSON_GetObjectItem(payload, "action")->valuestring;
            const char *target = cJSON_GetObjectItem(payload, "target")->valuestring;
            const char *value = cJSON_GetObjectItem(payload, "value")->valuestring;

            ESP_LOGI(TAG, "Executing Action: %s on %s -> %s", action, target, value);

            int gpio_num = -1;
            // 簡單的映射邏輯 (應與 server 端的 device_table 對應)
            if (strcmp(target, "light") == 0) gpio_num = 26; // 假設繼電器在 26
            else if (strcmp(target, "fan") == 0) gpio_num = 27;   // 假設風扇在 27
            else if (strcmp(target, "led") == 0) gpio_num = LED_PIN;

            if (gpio_num != -1) {
                int level = (strcmp(value, "on") == 0) ? 1 : 0;
                gpio_set_direction((gpio_num_t)gpio_num, GPIO_MODE_OUTPUT);
                gpio_set_level((gpio_num_t)gpio_num, level);
                ESP_LOGI(TAG, "GPIO %d set to %d", gpio_num, level);
            }
        }
    } else if (type && strcmp(type->valuestring, "play") == 0) {
        cJSON *payload = cJSON_GetObjectItem(root, "payload");
        if (payload) {
            const char *audio = cJSON_GetObjectItem(payload, "audio")->valuestring;
            ESP_LOGI(TAG, "Server requests playing audio: %s", audio);
            // TODO: 若有喇叭可在此實作播放
        }
    }

    cJSON_Delete(root);
}

/* ---------- WebSocket Event Handler ---------- */

static void websocket_event_handler(void *handler_args, esp_event_base_t base, int32_t event_id, void *event_data)
{
    esp_websocket_event_data_t *data = (esp_websocket_event_data_t *)event_data;
    switch (event_id) {
        case WEBSOCKET_EVENT_CONNECTED:
            ESP_LOGI(TAG, "WEBSOCKET_EVENT_CONNECTED");
            ws_connected = true;
            break;
        case WEBSOCKET_EVENT_DISCONNECTED:
            ESP_LOGI(TAG, "WEBSOCKET_EVENT_DISCONNECTED");
            ws_connected = false;
            break;
        case WEBSOCKET_EVENT_DATA:
            ESP_LOGI(TAG, "WEBSOCKET_EVENT_DATA");
            if (data->data_len > 0) {
                // Ensure data is null-terminated for cJSON
                char *buf = (char *)malloc(data->data_len + 1);
                if (buf) {
                    memcpy(buf, data->data_ptr, data->data_len);
                    buf[data->data_len] = '\0';
                    handle_server_action(buf);
                    free(buf);
                }
            }
            break;
        case WEBSOCKET_EVENT_ERROR:
            ESP_LOGI(TAG, "WEBSOCKET_EVENT_ERROR");
            break;
    }
}

static void init_websocket(void)
{
    esp_websocket_client_config_t ws_cfg = {};
    ws_cfg.uri = SERVER_URL;

    ws_client = esp_websocket_client_init(&ws_cfg);
    esp_websocket_register_events(ws_client, WEBSOCKET_EVENT_ANY, websocket_event_handler, (void *)ws_client);

    esp_websocket_client_start(ws_client);
}

/* ---------- Audio Configuration ---------- */

#define SAMPLE_RATE     16000
#define I2S_PORT_NUM    I2S_NUM_0
#define DMA_BUF_COUNT   8
#define DMA_BUF_LEN     256

#define VAD_THRESHOLD   1500.0f

/* ---------- Recording Configuration ---------- */

#define RECORD_DURATION_SEC  3
#define AUDIO_SAMPLES_3S     (SAMPLE_RATE * RECORD_DURATION_SEC)
#define AUDIO_BUFFER_SIZE_3S (AUDIO_SAMPLES_3S * sizeof(int16_t))

// Set to 1 to test Binary Transfer, 0 for Base64
#define USE_BINARY_STREAM    1

/* ---------- Globals ---------- */

static i2s_chan_handle_t rx_chan = NULL;
static float ei_slice_buffer[EI_CLASSIFIER_SLICE_SIZE];

/* ---------- Dynamic Audio Buffer for Recording (3 seconds, 96KB) ---------- */

static int16_t *recording_buffer = NULL;
static size_t recording_samples = 0;
static bool recording_complete = false;

/* ---------- I2S Initialization ---------- */

static void init_i2s(void)
{
    i2s_chan_config_t chan_cfg = I2S_CHANNEL_DEFAULT_CONFIG(I2S_PORT_NUM, I2S_ROLE_MASTER);
    chan_cfg.dma_desc_num  = DMA_BUF_COUNT;
    chan_cfg.dma_frame_num = DMA_BUF_LEN;
    chan_cfg.auto_clear    = true;
    ESP_ERROR_CHECK(i2s_new_channel(&chan_cfg, NULL, &rx_chan));

    i2s_std_config_t std_cfg;
    memset(&std_cfg, 0, sizeof(std_cfg));

    std_cfg.clk_cfg.sample_rate_hz = SAMPLE_RATE;
    std_cfg.clk_cfg.clk_src        = I2S_CLK_SRC_APLL; 
    std_cfg.clk_cfg.mclk_multiple  = I2S_MCLK_MULTIPLE_256;
    std_cfg.clk_cfg.bclk_div       = 8;

    std_cfg.slot_cfg.data_bit_width = I2S_DATA_BIT_WIDTH_32BIT;
    std_cfg.slot_cfg.slot_bit_width = I2S_SLOT_BIT_WIDTH_AUTO;
    std_cfg.slot_cfg.slot_mode      = I2S_SLOT_MODE_STEREO;
    std_cfg.slot_cfg.slot_mask      = I2S_STD_SLOT_BOTH;
    std_cfg.slot_cfg.ws_width       = I2S_DATA_BIT_WIDTH_32BIT;
    std_cfg.slot_cfg.ws_pol         = false;
    std_cfg.slot_cfg.bit_shift      = true;
#if SOC_I2S_HW_VERSION_1
    std_cfg.slot_cfg.msb_right      = false;
#else
    std_cfg.slot_cfg.left_align     = true;
    std_cfg.slot_cfg.big_endian     = false;
    std_cfg.slot_cfg.bit_order_lsb  = false;
#endif

    std_cfg.gpio_cfg.mclk = I2S_GPIO_UNUSED;
    std_cfg.gpio_cfg.bclk = I2S_BCK_GPIO;
    std_cfg.gpio_cfg.ws   = I2S_WS_GPIO;
    std_cfg.gpio_cfg.dout = I2S_GPIO_UNUSED;
    std_cfg.gpio_cfg.din  = I2S_DIN_GPIO;

    ESP_ERROR_CHECK(i2s_channel_init_std_mode(rx_chan, &std_cfg));
    ESP_ERROR_CHECK(i2s_channel_enable(rx_chan));

    printf("I2S initialized: %d Hz, Stereo Mode (Left Extracted), Pins: 32/25/33\r\n", SAMPLE_RATE);
}

/* ---------- Read Audio Slice (Stereo -> Mono Left) ---------- */

static bool read_audio_slice(float *out_buffer, size_t num_mono_samples, float *out_rms)
{
    const size_t bytes_per_sample = sizeof(int32_t);
    const size_t chunk_frames = 256;
    
