mimas9107/esp-miao/firmware/esp32_edge_impulse/main/main.cpp
    int32_t i2s_buf[chunk_frames * 2];

    size_t samples_read = 0;
    float sum_sq = 0.0f;

    while (samples_read < num_mono_samples) {
        size_t frames_to_read = num_mono_samples - samples_read;
        if (frames_to_read > chunk_frames) frames_to_read = chunk_frames;

        size_t bytes_read = 0;
        esp_err_t ret = i2s_channel_read(rx_chan, i2s_buf,
                                         frames_to_read * 2 * bytes_per_sample,
                                         &bytes_read, 1000);
        if (ret != ESP_OK) {
            printf("ERR: I2S read failed: %d\r\n", ret);
            return false;
        }

        size_t got_frames = bytes_read / (2 * bytes_per_sample);

        for (size_t i = 0; i < got_frames; i++) {
            int32_t raw_l = i2s_buf[i * 2];
            int32_t s = raw_l >> 11;
            
            if (s > 32767)  s = 32767;
            if (s < -32768) s = -32768;
            
            out_buffer[samples_read + i] = (float)s;
            sum_sq += (float)(s * s);
        }
        samples_read += got_frames;
    }

    if (out_rms) {
        *out_rms = sqrtf(sum_sq / num_mono_samples);
    }

    return true;
}

/* ---------- Read Audio to Int16 Buffer (Stereo -> Mono Left) ---------- */

static bool read_audio_to_buffer(int16_t *out_buffer, size_t num_samples)
{
    const size_t bytes_per_sample = sizeof(int32_t);
    const size_t chunk_frames = 256;
    
    int32_t i2s_buf[chunk_frames * 2];

    size_t samples_read = 0;

    while (samples_read < num_samples) {
        size_t frames_to_read = num_samples - samples_read;
        if (frames_to_read > chunk_frames) frames_to_read = chunk_frames;

        size_t bytes_read = 0;
        esp_err_t ret = i2s_channel_read(rx_chan, i2s_buf,
                                         frames_to_read * 2 * bytes_per_sample,
                                         &bytes_read, 1000);
        if (ret != ESP_OK) {
            printf("ERR: I2S read failed: %d\r\n", ret);
            return false;
        }

        size_t got_frames = bytes_read / (2 * bytes_per_sample);

        for (size_t i = 0; i < got_frames; i++) {
            int32_t raw_l = i2s_buf[i * 2];
            int32_t s = raw_l >> 11;
            
            if (s > 32767)  s = 32767;
            if (s < -32768) s = -32768;
            
            out_buffer[samples_read + i] = (int16_t)s;
        }
        samples_read += got_frames;
    }

    return true;
}

/* ---------- Send Audio Stream via WebSocket (Base64 Chunked) ---------- */

static bool send_audio_stream_b64(const int16_t *audio_data, size_t sample_count, float confidence)
{
    if (!ws_client || !ws_connected) {
        ESP_LOGE(TAG, "WebSocket not connected");
        return false;
    }

    // 1. Send audio_start
    char start_json[256];
    snprintf(start_json, sizeof(start_json), 
             "{\"device_id\":\"esp32_01\",\"timestamp\":%lu,\"type\":\"audio_start\",\"payload\":{\"total_samples\":%zu,\"confidence\":%.3f,\"transfer_mode\":\"base64\"}}",
             (unsigned long)xTaskGetTickCount(), sample_count, confidence);
    
    if (esp_websocket_client_send_text(ws_client, start_json, strlen(start_json), portMAX_DELAY) < 0) {
        return false;
    }

    // 2. Send chunks
    const size_t CHUNK_SAMPLES = 2048; // 4096 bytes per raw chunk
    size_t samples_sent = 0;
    int chunk_idx = 0;

    // Pre-calculate b64 size for the chunk
    size_t raw_chunk_size = CHUNK_SAMPLES * sizeof(int16_t);
    size_t b64_max_len = 0;
    mbedtls_base64_encode(NULL, 0, &b64_max_len, NULL, raw_chunk_size);
    
    char *b64_buffer = (char *)malloc(b64_max_len + 1);
    char *json_buffer = (char *)malloc(b64_max_len + 512);

    if (!b64_buffer || !json_buffer) {
        ESP_LOGE(TAG, "Failed to allocate streaming buffers");
        if (b64_buffer) free(b64_buffer);
        if (json_buffer) free(json_buffer);
        return false;
    }

    while (samples_sent < sample_count) {
        size_t to_send = sample_count - samples_sent;
        if (to_send > CHUNK_SAMPLES) to_send = CHUNK_SAMPLES;

        size_t b64_out_len = 0;
        mbedtls_base64_encode((unsigned char *)b64_buffer, b64_max_len, &b64_out_len, 
                              (const unsigned char *)(audio_data + samples_sent), 
                              to_send * sizeof(int16_t));
        b64_buffer[b64_out_len] = '\0';

        bool is_last = (samples_sent + to_send >= sample_count);
        int written = snprintf(json_buffer, b64_max_len + 512,
                               "{\"device_id\":\"esp32_01\",\"timestamp\":%lu,\"type\":\"audio_chunk\",\"payload\":{\"chunk_index\":%d,\"is_last\":%s,\"data_base64\":\"%s\"}}",
                               (unsigned long)xTaskGetTickCount(), chunk_idx, is_last ? "true" : "false", b64_buffer);

        if (esp_websocket_client_send_text(ws_client, json_buffer, written, portMAX_DELAY) < 0) {
            ESP_LOGE(TAG, "Failed to send chunk %d", chunk_idx);
            break;
        }

        samples_sent += to_send;
        chunk_idx++;
        vTaskDelay(pdMS_TO_TICKS(10)); // Prevent flooding
    }

    free(b64_buffer);
    free(json_buffer);
    
    return (samples_sent >= sample_count);
}

/* ---------- Send Audio Stream via WebSocket (Binary Chunked) ---------- */

static bool send_audio_stream_binary(const int16_t *audio_data, size_t sample_count, float confidence)
{
    if (!ws_client || !ws_connected) {
        ESP_LOGE(TAG, "WebSocket not connected");
        return false;
    }

    // 1. Send audio_start (JSON)
    char start_json[256];
    snprintf(start_json, sizeof(start_json), 
             "{\"device_id\":\"esp32_01\",\"timestamp\":%lu,\"type\":\"audio_start\",\"payload\":{\"total_samples\":%zu,\"confidence\":%.3f,\"transfer_mode\":\"binary\"}}",
             (unsigned long)xTaskGetTickCount(), sample_count, confidence);
    
    if (esp_websocket_client_send_text(ws_client, start_json, strlen(start_json), portMAX_DELAY) < 0) {
        return false;
    }

    // 2. Send raw binary data in chunks
    const size_t CHUNK_SAMPLES = 4096; // 8192 bytes per binary frame
    size_t samples_sent = 0;

    while (samples_sent < sample_count) {
        size_t to_send = sample_count - samples_sent;
        if (to_send > CHUNK_SAMPLES) to_send = CHUNK_SAMPLES;

