mimas9107/esp-miao/firmware/esp32_edge_impulse/main/main.cpp
        if (esp_websocket_client_send_bin(ws_client, (const char *)(audio_data + samples_sent), 
                                         to_send * sizeof(int16_t), portMAX_DELAY) < 0) {
            ESP_LOGE(TAG, "Failed to send binary chunk");
            break;
        }

        samples_sent += to_send;
        // Binary transfer is faster, but a small delay helps stability
        vTaskDelay(pdMS_TO_TICKS(5)); 
    }

    return (samples_sent >= sample_count);
}

/* ---------- Edge Impulse Signal Callback ---------- */

static int ei_audio_signal_get_data(size_t offset, size_t length, float *out_ptr)
{
    memcpy(out_ptr, ei_slice_buffer + offset, length * sizeof(float));
    return 0;
}

/* ---------- LED Control ---------- */

static void setup_led(void)
{
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
    esp_rom_gpio_pad_select_gpio(LED_PIN);
#elif ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
    gpio_pad_select_gpio(LED_PIN);
#endif
    gpio_set_direction(LED_PIN, GPIO_MODE_OUTPUT);
    gpio_set_level(LED_PIN, 0);
}

/* ---------- Inference Task ---------- */

static void inference_task(void *arg)
{
    printf("\r\n=== Edge Impulse Wake Word Detection ===\r\n");
    printf("Project : %s  (ID %d)\r\n", EI_CLASSIFIER_PROJECT_NAME, EI_CLASSIFIER_PROJECT_ID);
    printf("Window  : %d ms, Slices: %d\r\n", 
           (int)(EI_CLASSIFIER_RAW_SAMPLE_COUNT * 1000 / EI_CLASSIFIER_FREQUENCY),
           EI_CLASSIFIER_SLICES_PER_MODEL_WINDOW);
    printf("Threshold: %.2f\r\n", (float)EI_CLASSIFIER_THRESHOLD);
    printf("VAD Threshold: %.2f (RMS)\r\n\r\n", VAD_THRESHOLD);

    run_classifier_init();

    printf("Warming up microphone...\r\n");
    for (int i = 0; i < 8; i++) {
        read_audio_slice(ei_slice_buffer, EI_CLASSIFIER_SLICE_SIZE, NULL);
    }
    printf("Started.\r\n");

    ei_impulse_result_t result = {};

    while (1) {
        float current_rms = 0.0f;

        if (!read_audio_slice(ei_slice_buffer, EI_CLASSIFIER_SLICE_SIZE, &current_rms)) {
            vTaskDelay(pdMS_TO_TICKS(100));
            continue;
        }

        signal_t signal;
        signal.total_length = EI_CLASSIFIER_SLICE_SIZE;
        signal.get_data     = &ei_audio_signal_get_data;

        EI_IMPULSE_ERROR res = run_classifier_continuous(&signal, &result, false);
        if (res != EI_IMPULSE_OK) {
            printf("ERR: Inference failed (%d)\r\n", res);
            continue;
        }

        bool wake_word_detected = false;
        float detected_confidence = 0.0f;
        
        for (uint16_t i = 0; i < EI_CLASSIFIER_LABEL_COUNT; i++) {
            if (strcmp(ei_classifier_inferencing_categories[i], "heymiaomiao") == 0) {
                detected_confidence = result.classification[i].value;
                // Debug log for suspicious sounds
                if (detected_confidence > 0.5) {
                    printf("Probable hit: Conf: %.3f, RMS: %.2f\n", detected_confidence, current_rms);
                }
                
                if (detected_confidence >= EI_CLASSIFIER_THRESHOLD && current_rms > VAD_THRESHOLD) {
                    wake_word_detected = true;
                }
            }
        }

        if (wake_word_detected) {
            printf("\r\n>>> 🐱 WAKE WORD DETECTED! (Conf: %.3f) 🐱 <<<\r\n\r\n", detected_confidence);
            
            for (int k = 0; k < 3; k++) {
                gpio_set_level(LED_PIN, 1);
                vTaskDelay(pdMS_TO_TICKS(100));
                gpio_set_level(LED_PIN, 0);
                vTaskDelay(pdMS_TO_TICKS(100));
            }
            
            printf(">>> REC: Starting 3-second recording...\r\n");
            
            // Allocate memory dynamically
            recording_buffer = (int16_t *)malloc(AUDIO_BUFFER_SIZE_3S);
            if (recording_buffer == NULL) {
                printf(">>> REC: Failed to allocate memory (OOM)!\r\n");
                continue;
            }

            recording_samples = 0;
            recording_complete = false;
            
            bool success = read_audio_to_buffer(recording_buffer, AUDIO_SAMPLES_3S);
            
            if (success) {
                recording_samples = AUDIO_SAMPLES_3S;
                recording_complete = true;
                printf(">>> REC: Completed. Samples: %zu\r\n", recording_samples);
            } else {
                printf(">>> REC: Failed during I2S read!\r\n");
            }
            
            vTaskDelay(pdMS_TO_TICKS(100));
            
            if (recording_complete && recording_samples > 0) {
                printf(">>> WAV: Sending %zu samples via WebSocket (%s)...\r\n", 
                       recording_samples, USE_BINARY_STREAM ? "Binary" : "Base64 Streaming");
                
                bool sent = false;
                if (USE_BINARY_STREAM) {
                    sent = send_audio_stream_binary(recording_buffer, recording_samples, detected_confidence);
                } else {
                    sent = send_audio_stream_b64(recording_buffer, recording_samples, detected_confidence);
                }
                
                if (sent) {
                    printf(">>> WAV: Sent successfully!\r\n");
                } else {
                    printf(">>> WAV: Send failed!\r\n");
                }
            }
            
            // FREE memory after sending
            free(recording_buffer);
            recording_buffer = NULL;
            
            vTaskDelay(pdMS_TO_TICKS(500));
        }
    }
}

extern "C" int app_main()
{
    // Initialize NVS
    esp_err_t ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES || ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        ret = nvs_flash_init();
    }
    ESP_ERROR_CHECK(ret);

    setup_led();
    init_wifi();
    init_websocket();
    init_i2s();
    
    xTaskCreate(inference_task, "ei_infer", 16384, NULL, 5, NULL);
    return 0;
}
